In [4]:
import pandas as pd
import numpy as np

In [2]:
from sqlalchemy import create_engine

In [3]:
temp_db = create_engine('sqlite:///:memory:')

In [7]:
df = pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4,4)), columns=['a','b','c','d'])

In [8]:
df

    a   b   c   d
0  22  51  46   6
1  96  38   3  17
2  56  44  63   1
3  38  86  43   3

In [10]:
df.to_sql(name="new_table", con=temp_db)

ValueError: Table 'new_table' already exists.

In [11]:
new_df = pd.read_sql(sql="new_table", con=temp_db)

In [12]:
new_df

   index   a   b   c   d
0      0  22  51  46   6
1      1  96  38   3  17
2      2  56  44  63   1
3      3  38  86  43   3